касса_Вегас/src/Documents/ВнесениеИзъятиеНаличных/ВнесениеИзъятиеНаличных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнесениеИзъятиеНаличных</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДвиженияНаличных</name>
    <type>
      <types>EnumRef.ВидыДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

касса_Вегас/src/Enums/ВидыДвиженияДС/ВидыДвиженияДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженияДС</name>
  <enumValues>
    <name>Внесение</name>
  </enumValues>
  <enumValues>
    <name>Изъятие</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Enums/ТипыОплаты/ТипыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОплаты</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ВстречноеПредоставление</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>Постоплата</name>
  </enumValues>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
</mdclass:Enum>

касса_Вегас/src/Documents/ВнесениеИзъятиеНаличных/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнесениеИзъятиеНаличных.Дата КАК Период,
	|	&ТипОплаты КАК ТипОплаты,
	|	ВнесениеИзъятиеНаличных.КассоваяСмена КАК КассоваяСмена,
	|	ВЫБОР
	|		КОГДА ВнесениеИзъятиеНаличных.ВидДвиженияНаличных = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Внесение)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВнесениеИзъятиеНаличных.Сумма,
	|	ВнесениеИзъятиеНаличных.ВидДвиженияНаличных КАК ВидДвиженияДС
	|ИЗ
	|	Документ.ВнесениеИзъятиеНаличных КАК ВнесениеИзъятиеНаличных
	|ГДЕ
	|	ВнесениеИзъятиеНаличных.Ссылка = &Ссылка";
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТипОплаты", Перечисления.ТипыОплаты.Наличные);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", Результат[0].Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
